EDTДоговоры_ПРОФ_демо/src/Catalogs/ВидыДокументов/ВидыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДокументов</name>
  <attributes>
    <name>Автозаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПримерНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособНумерации</name>
    <type>
      <types>EnumRef.СпособыНумерации</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДоговорныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматНомера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоГотовит</name>
    <type>
      <types>EnumRef.КтоГотовит</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПравилаАвтозаполнения</name>
    <attributes>
      <name>ШаблонФайла</name>
      <type>
        <types>CatalogRef.Файлы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоАвтозаполнения</name>
      <type>
        <types>CatalogRef.ПравилаАвтозаполненияФайлов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДляКого</name>
      <type>
        <types>EnumRef.ЮридическоеФизическоеЛицо</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Этапы</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Срок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDTДоговоры_ПРОФ_демо/src/Enums/ТипыДоговорныхДокументов/ТипыДоговорныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДоговорныхДокументов</name>
  <enumValues>
    <name>Договор</name>
  </enumValues>
  <enumValues>
    <name>ДопСоглашение</name>
  </enumValues>
  <enumValues>
    <name>Акт</name>
  </enumValues>
  <enumValues>
    <name>Накладная</name>
  </enumValues>
  <enumValues>
    <name>Счет</name>
  </enumValues>
</mdclass:Enum>

EDTДоговоры_ПРОФ_демо/src/Enums/КтоГотовит/КтоГотовит.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КтоГотовит</name>
  <enumValues>
    <name>Организация</name>
  </enumValues>
  <enumValues>
    <name>Контрагент</name>
  </enumValues>
</mdclass:Enum>

EDTДоговоры_ПРОФ_демо/src/Catalogs/ВидыДокументов/Forms/ФормаСоздания/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Родитель") И ЗначениеЗаполнено(Параметры.Родитель) Тогда 
		ТипДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Родитель, "ВидДокумента.Тип");
		
		Если ТипДокумента = Перечисления.ТипыДоговорныхДокументов.Договор Тогда 
			
			Типы.Добавить(Перечисления.ТипыДоговорныхДокументов.ДопСоглашение, "Допсоглашение");
			Типы.Добавить(Перечисления.ТипыДоговорныхДокументов.Акт);
			Типы.Добавить(Перечисления.ТипыДоговорныхДокументов.Накладная);
			Типы.Добавить(Перечисления.ТипыДоговорныхДокументов.Счет);
			
		ИначеЕсли ТипДокумента = Перечисления.ТипыДоговорныхДокументов.ДопСоглашение Тогда 
			
			Типы.Добавить(Перечисления.ТипыДоговорныхДокументов.Акт);
			Типы.Добавить(Перечисления.ТипыДоговорныхДокументов.Накладная);
			Типы.Добавить(Перечисления.ТипыДоговорныхДокументов.Счет);
			
		ИначеЕсли ТипДокумента = Перечисления.ТипыДоговорныхДокументов.Акт 
			Или ТипДокумента = Перечисления.ТипыДоговорныхДокументов.Накладная Тогда
			
			Типы.Добавить(Перечисления.ТипыДоговорныхДокументов.Счет);
			
		КонецЕсли;
	Иначе 
		Типы.Добавить(Перечисления.ТипыДоговорныхДокументов.Договор);
		Типы.Добавить(Перечисления.ТипыДоговорныхДокументов.ДопСоглашение, "Допсоглашение");
		Типы.Добавить(Перечисления.ТипыДоговорныхДокументов.Акт);
		Типы.Добавить(Перечисления.ТипыДоговорныхДокументов.Накладная);
		Типы.Добавить(Перечисления.ТипыДоговорныхДокументов.Счет);
	КонецЕсли;
	
	КтоГотовит.Добавить(Перечисления.КтоГотовит.Организация, НСтр("ru = 'Документ готовим мы'"));
	КтоГотовит.Добавить(Перечисления.КтоГотовит.Контрагент, НСтр("ru = 'Приходит от контрагента'"));
	
	Если Параметры.Свойство("РежимСозданияДоговора") Тогда 
		РежимСозданияДоговора = Параметры.РежимСозданияДоговора;
	КонецЕсли;
	
	Если Параметры.Свойство("НеСоздаватьДокументПриЗакрытии") Тогда 
		НеСоздаватьДокументПриЗакрытии = Параметры.НеСоздаватьДокументПриЗакрытии;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыбранныйТип = Типы.НайтиПоИдентификатору(ВыбраннаяСтрока).Значение;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаКтоГотовит;
	
КонецПроцедуры

&НаКлиенте
Процедура КтоГотовитВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыбранныйКтоГотовит = КтоГотовит.НайтиПоИдентификатору(ВыбраннаяСтрока).Значение;
	
	ОткрытьФормуНовогоВида();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Далее(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаТипы Тогда 
	
		Если Элементы.Типы.ТекущиеДанные = Неопределено Тогда 
			ВыбранныйТип = Типы[0].Значение;
		Иначе
			ВыбранныйТип = Элементы.Типы.ТекущиеДанные.Значение;
		КонецЕсли;	
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаКтоГотовит;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаКтоГотовит Тогда 
		
		Если Элементы.КтоГотовит.ТекущиеДанные = Неопределено Тогда 
			ВыбранныйКтоГотовит = КтоГотовит[0].Значение;
		Иначе
			ВыбранныйКтоГотовит = Элементы.КтоГотовит.ТекущиеДанные.Значение;
		КонецЕсли;	
			
		ОткрытьФормуНовогоВида();
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуНовогоВида()
	
	Модифицированность = Ложь;
	Закрыть();
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Тип", ВыбранныйТип);
	ЗначенияЗаполнения.Вставить("КтоГотовит", ВыбранныйКтоГотовит);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	Если РежимСозданияДоговора Тогда 
		ПараметрыФормы.Вставить("РежимСозданияДоговора", РежимСозданияДоговора);
	КонецЕсли;	
	
	Если НеСоздаватьДокументПриЗакрытии Тогда 
		ПараметрыФормы.Вставить("НеСоздаватьДокументПриЗакрытии", НеСоздаватьДокументПриЗакрытии);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ВидыДокументов.Форма.ФормаЭлемента", ПараметрыФормы, ВладелецФормы);
	
КонецПроцедуры	

#КонецОбласти
